FinalIter_May2/app/controllers/password_resets_controller.rb

  def create
    @user = User.find_by(phone: params[:password_reset][:phone].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."phone" = ? LIMIT 1  [["phone", ""]]

  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$wINcihSSFf1QNP0syYp.mO7vnK8r9Q7mP9DQY5OSdxzDhOS4lgoJ6"], ["updated_at", "2018-03-20 18:37:40.200049"], ["id", 762146111]]