FinalIter_May2/app/controllers/sessions_controller.rb

  def create
    user = User.find_by(phone: params[:session][:phone])
---
SELECT  "users".* FROM "users" WHERE "users"."phone" = ? LIMIT 1  [["phone", "michael@example.com"]]