our_app_iter5/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."admin" = 't' LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE "users"."admin" = 't'
---
  def index
    if (current_user.admin?)
    @users = User.paginate(page: params[:page])
    else
     @users = User.where(admin:true).paginate(:page => params[:page])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ?  ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["user_id", 5]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 5]]
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])

INSERT INTO "users" ("name", "phone", "password_digest", "created_at", "updated_at", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
  def following
    @title = "My Classes"
    @user  = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
  def followers
    @title = "Registered Users"
    @user  = User.find(params[:id])