our_app_iter2/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "phone", "password_digest", "created_at", "updated_at", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "name" = ?, "phone" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Foo Bar"], ["phone", "foo@bar.com"], ["updated_at", "2018-03-20 18:37:40.707053"], ["id", 762146111]]
---
  def update
    if @user.update_attributes(user_params)